test-plan/查询压力测试/优化/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.8966000000002,
    "medianResTime" : 151.0,
    "minResTime" : 2.0,
    "maxResTime" : 795.0,
    "pct1ResTime" : 331.89999999999964,
    "pct2ResTime" : 379.0,
    "pct3ResTime" : 463.9899999999998,
    "throughput" : 1816.8604651162789,
    "receivedKBytesPerSec" : 12941.220483114554,
    "sentKBytesPerSec" : 613.9001180959303
  },
  "号源查询请求-优化" : {
    "transaction" : "号源查询请求-优化",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.8966000000002,
    "medianResTime" : 151.0,
    "minResTime" : 2.0,
    "maxResTime" : 795.0,
    "pct1ResTime" : 331.89999999999964,
    "pct2ResTime" : 379.0,
    "pct3ResTime" : 463.9899999999998,
    "throughput" : 1816.8604651162789,
    "receivedKBytesPerSec" : 12941.220483114554,
    "sentKBytesPerSec" : 613.9001180959303
  }
}